"""
1.

Программа выводить в консоль текст загадки и ждать ввода пользователя
Программа после ввода пользователя ответа должна вывести в консоль результат: правильный ли ответ дал пользователь
Загадок должно быть 3, тематика вопросов должна быть по первому занятию
Дополнительные требования :
Программа должна в конце игры сказать, сколько ответов дал пользователь: сколько из них было верных
Программа должна не учитывать регистр ответа: "Python" и "python" оба должны быть правильным ответом на вопрос "Какой язык мы учим?"
"""




"""
2.

Написать программу - игра "угадай число". Компьютер загадывает случайное число от 0 до 100. Вы должны угадать это число 
за 6-8 попыток. 
Примечание: прописать логику программы так, что бы при не правильном ответе программа подсказывала вам : "ваше число больше чем у компьюетра", 
либо "ваше число меньше, чем у компьютера"
""" 